<?php

namespace Lukasoppermann\Httpstatus\languages;

use Lukasoppermann\Httpstatus\LanguageInterface;

class ar implements LanguageInterface
{
    protected $httpStatus = [
        100 => 'متابعة',
        101 => 'تغيير البروتوكولات',
        102 => 'معالجة',
        200 => 'حسنًا',
        201 => 'تم الإنشاء',
        202 => 'مقبول',
        203 => 'معلومات غير مأذون بها',
        204 => 'لا محتوى',
        205 => 'إعادة تعيين المحتوى',
        206 => 'جزئي المحتوى',
        207 => 'حالة متعددة',
        208 => 'تم الإبلاغ بالفعل',
        226 => 'تم استخدام IM',
        300 => 'خيارات متعددة',
        301 => 'تم التحول بشكل دائم',
        302 => 'تم العثور',
        303 => 'انظر لآخر',
        304 => 'غير معدل',
        305 => 'استخدام الوكيل',
        307 => 'توجيه مؤقت',
        308 => 'توجيه دائم',
        400 => 'طلب خاطئ',
        401 => 'غير مصرح به',
        402 => 'مطلوب الدفع',
        403 => 'ممنوع',
        404 => 'غير موجود',
        405 => 'الطريقة غير مسموح بها',
        406 => 'غير مقبول',
        407 => 'مطلوبة مصادقة الوكيل',
        408 => 'انتهاء الطلب',
        409 => 'تعارض',
        410 => 'ذهب',
        411 => 'الطول المطلوب',
        412 => 'فشل الشرط المسبق',
        413 => 'حمولة كبيرة جدا',
        414 => 'URI طويل جدا',
        415 => 'نوع الوسائط غير مدعوم',
        416 => 'النطاق غير مرضٍ',
        417 => 'فشل الاكسبشن',
        418 => 'تي بوت',
        421 => 'طلب مُعكس',
        422 => 'كيان غير قابل للمعالجة',
        423 => 'مُقفل',
        424 => 'فشل الاعتماد',
        425 => 'مبكر جدا',
        426 => 'الترقية مطلوبة',
        428 => 'الشرط المطلوب',
        429 => 'طلبات كثيرة جدا',
        431 => 'حقول رأس الطلب كبيرة جدا',
        451 => 'غير متاح لأسباب قانونية',
        500 => 'خطأ في الخادم الداخلي',
        501 => 'غير مُنفذ',
        502 => 'بوابة خاطئة',
        503 => 'الخدمة غير متوفرة',
        504 => 'انتهاء وقت الانتظار للبوابة',
        505 => 'إصدار HTTP غير مدعوم',
        506 => 'المتفاوض عليه أيضًا',
        507 => 'تخزين غير كافٍ',
        508 => 'تم الكشف عن حلقة',
        510 => 'غير موسع',
        511 => 'مطلوبة المصادقة عبر الشبكة',
    ];

    /**
     * {@inheritdoc}
     */
    public function getHttpStatus()
    {
        return $this->httpStatus;
    }
}
